bergb1/PSoC-safe-cracking-minigame/Lab7.cydsn/Generated_Source/PSoC5/TIMER_SOUND.h
/*******************************************************************************
* File Name: TIMER_SOUND.h
* Version 2.80
*
*  Description:
*     Contains the function prototypes and constants available to the timer
*     user module.
*
*   Note:
*     None
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CY_TIMER_TIMER_SOUND_H)
#define CY_TIMER_TIMER_SOUND_H

#include "cytypes.h"
#include "cyfitter.h"
#include "CyLib.h" /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */

extern uint8 TIMER_SOUND_initVar;

/* Check to see if required defines such as CY_PSOC5LP are available */
/* They are defined starting with cy_boot v3.0 */
#if !defined (CY_PSOC5LP)
    #error Component Timer_v2_80 requires cy_boot v3.0 or later
#endif /* (CY_ PSOC5LP) */


/**************************************
*           Parameter Defaults
**************************************/

#define TIMER_SOUND_Resolution                 16u
#define TIMER_SOUND_UsingFixedFunction         1u
#define TIMER_SOUND_UsingHWCaptureCounter      0u
#define TIMER_SOUND_SoftwareCaptureMode        0u
#define TIMER_SOUND_SoftwareTriggerMode        0u
#define TIMER_SOUND_UsingHWEnable              0u
#define TIMER_SOUND_EnableTriggerMode          0u
#define TIMER_SOUND_InterruptOnCaptureCount    0u
#define TIMER_SOUND_RunModeUsed                0u
#define TIMER_SOUND_ControlRegRemoved          0u

#if defined(TIMER_SOUND_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG)
    #define TIMER_SOUND_UDB_CONTROL_REG_REMOVED            (0u)
#elif  (TIMER_SOUND_UsingFixedFunction)
    #define TIMER_SOUND_UDB_CONTROL_REG_REMOVED            (0u)
#else 
    #define TIMER_SOUND_UDB_CONTROL_REG_REMOVED            (1u)
#endif /* End TIMER_SOUND_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG */


/***************************************
*       Type defines
***************************************/


/**************************************************************************
 * Sleep Wakeup Backup structure for Timer Component
 *************************************************************************/
typedef struct
{
    uint8 TimerEnableState;
    #if(!TIMER_SOUND_UsingFixedFunction)

        uint16 TimerUdb;
        uint8 InterruptMaskValue;
        #if (TIMER_SOUND_UsingHWCaptureCounter)
            uint8 TimerCaptureCounter;
        #endif /* variable declarations for backing up non retention registers in CY_UDB_V1 */

        #if (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED)
            uint8 TimerControlRegister;
        #endif /* variable declaration for backing up enable state of the Timer */
    #endif /* define backup variables only for UDB implementation. Fixed function registers are all retention */

}TIMER_SOUND_backupStruct;


/***************************************
*       Function Prototypes
***************************************/

void    TIMER_SOUND_Start(void) ;
void    TIMER_SOUND_Stop(void) ;

void    TIMER_SOUND_SetInterruptMode(uint8 interruptMode) ;
uint8   TIMER_SOUND_ReadStatusRegister(void) ;
/* Deprecated function. Do not use this in future. Retained for backward compatibility */
#define TIMER_SOUND_GetInterruptSource() TIMER_SOUND_ReadStatusRegister()

#if(!TIMER_SOUND_UDB_CONTROL_REG_REMOVED)
    uint8   TIMER_SOUND_ReadControlRegister(void) ;
    void    TIMER_SOUND_WriteControlRegister(uint8 control) ;
#endif /* (!TIMER_SOUND_UDB_CONTROL_REG_REMOVED) */

uint16  TIMER_SOUND_ReadPeriod(void) ;
void    TIMER_SOUND_WritePeriod(uint16 period) ;
uint16  TIMER_SOUND_ReadCounter(void) ;
void    TIMER_SOUND_WriteCounter(uint16 counter) ;
uint16  TIMER_SOUND_ReadCapture(void) ;
void    TIMER_SOUND_SoftwareCapture(void) ;

#if(!TIMER_SOUND_UsingFixedFunction) /* UDB Prototypes */
    #if (TIMER_SOUND_SoftwareCaptureMode)
        void    TIMER_SOUND_SetCaptureMode(uint8 captureMode) ;
    #endif /* (!TIMER_SOUND_UsingFixedFunction) */

    #if (TIMER_SOUND_SoftwareTriggerMode)
        void    TIMER_SOUND_SetTriggerMode(uint8 triggerMode) ;
    #endif /* (TIMER_SOUND_SoftwareTriggerMode) */

    #if (TIMER_SOUND_EnableTriggerMode)
        void    TIMER_SOUND_EnableTrigger(void) ;
        void    TIMER_SOUND_DisableTrigger(void) ;
    #endif /* (TIMER_SOUND_EnableTriggerMode) */


    #if(TIMER_SOUND_InterruptOnCaptureCount)
        void    TIMER_SOUND_SetInterruptCount(uint8 interruptCount) ;
    #endif /* (TIMER_SOUND_InterruptOnCaptureCount) */

    #if (TIMER_SOUND_UsingHWCaptureCounter)
        void    TIMER_SOUND_SetCaptureCount(uint8 captureCount) ;
        uint8   TIMER_SOUND_ReadCaptureCount(void) ;
    #endif /* (TIMER_SOUND_UsingHWCaptureCounter) */

    void TIMER_SOUND_ClearFIFO(void) ;
#endif /* UDB Prototypes */

/* Sleep Retention APIs */
void TIMER_SOUND_Init(void)          ;
void TIMER_SOUND_Enable(void)        ;
void TIMER_SOUND_SaveConfig(void)    ;
void TIMER_SOUND_RestoreConfig(void) ;
void TIMER_SOUND_Sleep(void)         ;
void TIMER_SOUND_Wakeup(void)        ;


/***************************************
*   Enumerated Types and Parameters
***************************************/

/* Enumerated Type B_Timer__CaptureModes, Used in Capture Mode */
#define TIMER_SOUND__B_TIMER__CM_NONE 0
#define TIMER_SOUND__B_TIMER__CM_RISINGEDGE 1
#define TIMER_SOUND__B_TIMER__CM_FALLINGEDGE 2
#define TIMER_SOUND__B_TIMER__CM_EITHEREDGE 3
#define TIMER_SOUND__B_TIMER__CM_SOFTWARE 4



/* Enumerated Type B_Timer__TriggerModes, Used in Trigger Mode */
#define TIMER_SOUND__B_TIMER__TM_NONE 0x00u
#define TIMER_SOUND__B_TIMER__TM_RISINGEDGE 0x04u
#define TIMER_SOUND__B_TIMER__TM_FALLINGEDGE 0x08u
#define TIMER_SOUND__B_TIMER__TM_EITHEREDGE 0x0Cu
#define TIMER_SOUND__B_TIMER__TM_SOFTWARE 0x10u


